docs/ODD+D_protocol.org
#+title: ODD+D protocol
#+author: Luis Guillermo García Jácome
#+bibliography: PePe-ref.bib

* Overview
** Purpose
*** What is the purpose of the study?
To understand the possible consequences of the management strategies that impact on the distribution of the shared space between the fishing industry, oil industry and conservation in the Bank of Campeche. To build  a system of agreements towards the sustainable use of the sheared sea-space, by the use of serious games.
*** For whom is the model designed?
For different local stakeholders participating in workshops and interested in the usage and management of the sea landscape (fisheries leaders, fishers, conservation agencies representatives, oil industry representatives, government representatives).
** Entities, state variables and scales
*** What kinds of entities are in the model?
- one human entity: boats
- two infrastructure entity: oil platforms, oil tankers, ports
- one biological entity: turtles
- one bio-physical entity: sea patches
*** By what attributes (i.e., state variables and parameters) are these  entities characterized?
- Boats: a port where it lands, a fishing region, an state describing the action it carries out at each moment (resting, planning, moving, fishing, landing), a preferred fishing patch, a catch and income, a capturability and maximum vessel capacity, a crew size, an economic state (viable, crisis, bankruptcy).
- Oil platforms: a daily production and income.
- Oil tankers: a platform where it loads and a port where it lands
- Turtles: a state describing if it is migrating or feeding.
- Sea patches: a type (sea, land), the biomass of the fishing species, an oil concentration, a zoning type (restricted, protected, free), a region id representing different fishing regions, a spilled state.
*** What are the exogenous factors/drivers of the model?
The catch and oil prices are fixed. The probability of an oil spill probabilities is fixed. 
*** If applicable, how is space included in the model?
Space is included implicitly, each patch represents a spatial unit, ports and oil platforms have a fixed position and boats, oil tankers, turtles and biomass move in the space.
*** What are the temporal and spatial resolutions and extents of the model?
Each time step represents a day. The size of the virtual world is 30 \times 30 pixels (with 3 extra pixels at the right of the word representing land) where each individual patch represents 3 km^2 representing a sea area of 8,100 km^2 which corresponds to an approximate fishing area of a local community.
** Process overview and scheduling
*** What entity does what, and in what order?
Daily a boat has 24 hours to carry out 5 different activities: rest at port, plan next trip, move towards a destination, fish and land at port. Each activity costs time to the boat.
Daily the biomass at a patch disperses to neighbor patches, and annually biomass at each patch regenerates.
Daily oil platforms extract oil and oil spills can occur with certain a probability. While oil platforms are profitable oil tankers transport the production to nearest port.
Turtles move daily to neighboring patches, and migrate and reproduce one a year.
Output variables and game thresholds are updated and checked monthly.
* Design Concepts
** Theoretical and Empirical Background
*** Which general concepts, theories or hypotheses are underlying the model's design at the system level or at the level(s) of the sub-model(s) (apart from the decision model)? What is the link to complexity and the purpose of the model?
Biomass regenerates following a logistic equation. Biomass disperses by simple diffusion. Oil extraction follows a exponential decay limited by a maximum extraction capacity. Turtles behavior follow a general migratory pattern characteristic of the species.
*** On what assumptions is/are the agents' decision model(s) based?
To choose where to fish boat agents follow an Explore-Exploit-Imitate dynamics [cite:@bailey2019], a modification of the epsilon-greedy algorithm of the Explore-Exploit dilemma. To choose where to continue fishing during a trip boat agents follow and /ad-hoc/ rule where they choose randomly a nearby patch. 
*** Why is/are certain decision model(s) chosen?
The decision model of the boat agents was chosen because this simple model has been previously demonstrated to reproduce some empirical observed patterns [cite:@bailey2019; @carrella2020].
Some main decision of the model such as the fishing region, number of fishers, oil platforms region, protected area size and fishing bans are left to the game players. The game narrative treats the players as a members of a spatial planning committee that are exposed to different scenarios. One purpose of the game is to highlight trade-offs that emerge form some management decisions of these three sectors.
*** If the model/sub-model (e.g., the decision model) is based on empirical data, where to the data come from?
The conceptual model is not based on empirical data. Some calibration of parameter is based on empirical data.
*** At which level of aggregation where the data available?
Does not apply.
** Individual Decision Making
*** What are the subjects and objects of the decision-making? On which level of aggregation is decision-making modeled? Are multiple levels of decision making included?
Boats decide the patch where they are going to fish using the Explore-Exploit-Imitate algorithm [cite:@bailey2019].
*** What is the basic rationality behind agent decision-making in the model? Do agents pursue an explicit objective of have other success criteria?
Boat agents choose where to fish based on where they or their friends have gained the most economic income in previous trips. As the income gained changes as the biomass available at a patch goes down and as boats go farther away form the port, they need to explore new sites to increase again their income. 
*** How do agents make their decisions?
Se details at Sub-model section.
*** Do the agents adapt their behaviors to changing endogenous and exogenous sate variables? And if yes, how?
Yes. Boat agents choose where to fish based on the income they gain in previous trips in a site. The catches that determine the gain change as biomass availability fluctuates with competition, migration, regrowth and oil spill damage. Agents adapt this changes by exploring new fishing sites.
*** Do social norms or cultural values play a role in the decision-making process?
No.
*** Do spatial aspects play a role in the decision process?
No. But the distance traveled influence the gain that the boat agents gain from fishing and thus the site they choose for fishing.
