docs/ODD+D_protocol.tex
% Created 2024-07-03 Wed 18:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Luis Guillermo García Jácome}
\date{\today}
\title{ODD+D protocol}
\hypersetup{
 pdfauthor={Luis Guillermo García Jácome},
 pdftitle={ODD+D protocol},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Overview}
\label{sec:orga0e63cd}
\subsection{Purpose}
\label{sec:orgafebede}
\subsubsection{What is the purpose of the study?}
\label{sec:orgd22783f}
To understand the possible consequences of the management strategies that impact on the distribution of the shared space between the fishing industry, oil industry and conservation in the Bank of Campeche. To build  a system of agreements towards the sustainable use of the sheared sea-space, by the use of serious games.
\subsubsection{For whom is the model designed?}
\label{sec:org279b7c9}
For different local stakeholders participating in workshops and interested in the usage and management of the sea landscape (fisheries leaders, fishers, conservation agencies representatives, oil industry representatives, government representatives).
\subsection{Entities, state variables and scales}
\label{sec:orga67d89f}
\subsubsection{What kinds of entities are in the model?}
\label{sec:org2cc4e60}
\begin{itemize}
\item one human entity: boats
\item two infrastructure entity: oil platforms, oil tankers, ports
\item one biological entity: turtles
\item one bio-physical entity: sea patches
\end{itemize}
\subsubsection{By what attributes (i.e., state variables and parameters) are these  entities characterized?}
\label{sec:orgf51fbdd}
\begin{itemize}
\item Boats: a port where it lands, a fishing region, an state describing the action it carries out at each moment (resting, planning, moving, fishing, landing), a preferred fishing patch, a catch and income, a capturability and maximum vessel capacity, a crew size, an economic state (viable, crisis, bankruptcy).
\item Oil platforms: a daily production and income.
\item Oil tankers: a platform where it loads and a port where it lands
\item Turtles: a state describing if it is migrating or feeding.
\item Sea patches: a type (sea, land), the biomass of the fishing species, an oil concentration, a zoning type (restricted, protected, free), a region id representing different fishing regions, a spilled state.
\end{itemize}
\subsubsection{What are the exogenous factors/drivers of the model?}
\label{sec:org0eba9fd}
The catch and oil prices are fixed. The probability of an oil spill probabilities is fixed. 
\subsubsection{If applicable, how is space included in the model?}
\label{sec:org24f53b7}
Space is included implicitly, each patch represents a spatial unit, ports and oil platforms have a fixed position and boats, oil tankers, turtles and biomass move in the space.
\subsubsection{What are the temporal and spatial resolutions and extents of the model?}
\label{sec:orgef37932}
Each time step represents a day. The size of the virtual world is 30 \texttimes{} 30 pixels (with 3 extra pixels at the right of the word representing land) where each individual patch represents 3 km\textsuperscript{2} representing a sea area of 8,100 km\textsuperscript{2} which corresponds to an approximate fishing area of a local community.
\subsection{Process overview and scheduling}
\label{sec:org112e0b9}
\subsubsection{What entity does what, and in what order?}
\label{sec:orgc6f1c72}
Daily a boat has 24 hours to carry out 5 different activities: rest at port, plan next trip, move towards a destination, fish and land at port. Each activity costs time to the boat.
Daily the biomass at a patch disperses to neighbor patches, and annually biomass at each patch regenerates.
Daily oil platforms extract oil and oil spills can occur with certain a probability. While oil platforms are profitable oil tankers transport the production to nearest port.
Turtles move daily to neighboring patches, and migrate and reproduce one a year.
Output variables and game thresholds are updated and checked monthly.
\section{Design Concepts}
\label{sec:orgb0d1bd0}
\subsection{Theoretical and Empirical Background}
\label{sec:orgc09369c}
\subsubsection{Which general concepts, theories or hypotheses are underlying the model's design at the system level or at the level(s) of the sub-model(s) (apart from the decision model)? What is the link to complexity and the purpose of the model?}
\label{sec:org349589a}
Biomass regenerates following a logistic equation. Biomass disperses by simple diffusion. Oil extraction follows a exponential decay limited by a maximum extraction capacity. Turtles behavior follow a general migratory pattern characteristic of the species.
\subsubsection{On what assumptions is/are the agents' decision model(s) based?}
\label{sec:orgaaf2dea}
To choose where to fish boat agents follow an Explore-Exploit-Imitate dynamics (Bailey, Richard M. and Carrella, Ernesto and Axtell, Robert and Burgess, Matthew G. and Cabral, Reniel B. and Drexler, Michael and Dorsett, Chris and Madsen, Jens Koed and Merkl, Andreas and Saul, Steven, 2019), a modification of the epsilon-greedy algorithm of the Explore-Exploit dilemma. To choose where to continue fishing during a trip boat agents follow and \emph{ad-hoc} rule where they choose randomly a nearby patch. 
\subsubsection{Why is/are certain decision model(s) chosen?}
\label{sec:orgacea421}
The decision model of the boat agents was chosen because this simple model has been previously demonstrated to reproduce some empirical observed patterns (Bailey, Richard M. and Carrella, Ernesto and Axtell, Robert and Burgess, Matthew G. and Cabral, Reniel B. and Drexler, Michael and Dorsett, Chris and Madsen, Jens Koed and Merkl, Andreas and Saul, Steven, 2019,  Carrella, Ernesto and Saul, Steven and Marshall, Kristin and Burgess, Matthew G. and Cabral, Reniel B. and Bailey, Richard M. and Dorsett, Chris and Drexler, Michael and Madsen, Jens Koed and Merkl, Andreas, 2020).
Some main decision of the model such as the fishing region, number of fishers, oil platforms region, protected area size and fishing bans are left to the game players. The game narrative treats the players as a members of a spatial planning committee that are exposed to different scenarios. One purpose of the game is to highlight trade-offs that emerge form some management decisions of these three sectors.
\subsubsection{If the model/sub-model (e.g., the decision model) is based on empirical data, where to the data come from?}
\label{sec:orgb6a1bd2}
The conceptual model is not based on empirical data. Some calibration of parameter is based on empirical data.
\subsubsection{At which level of aggregation where the data available?}
\label{sec:org8720dbf}
Does not apply.
\subsection{Individual Decision Making}
\label{sec:orga4cac2c}
\subsubsection{What are the subjects and objects of the decision-making? On which level of aggregation is decision-making modeled? Are multiple levels of decision making included?}
\label{sec:org50524cc}
Boats decide the patch where they are going to fish using the Explore-Exploit-Imitate algorithm (Bailey, Richard M. and Carrella, Ernesto and Axtell, Robert and Burgess, Matthew G. and Cabral, Reniel B. and Drexler, Michael and Dorsett, Chris and Madsen, Jens Koed and Merkl, Andreas and Saul, Steven, 2019).
\subsubsection{What is the basic rationality behind agent decision-making in the model? Do agents pursue an explicit objective of have other success criteria?}
\label{sec:org5fbb1b7}
Boat agents choose where to fish based on where they or their friends have gained the most economic income in previous trips. As the income gained changes as the biomass available at a patch goes down and as boats go farther away form the port, they need to explore new sites to increase again their income. 
\subsubsection{How do agents make their decisions?}
\label{sec:org351de93}
Se details at Sub-model section.
\subsubsection{Do the agents adapt their behaviors to changing endogenous and exogenous sate variables? And if yes, how?}
\label{sec:org04cde92}
Yes. Boat agents choose where to fish based on the income they gain in previous trips in a site. The catches that determine the gain change as biomass availability fluctuates with competition, migration, regrowth and oil spill damage. Agents adapt this changes by exploring new fishing sites.
\subsubsection{Do social norms or cultural values play a role in the decision-making process?}
\label{sec:org7dcf0ae}
No.
\subsubsection{Do spatial aspects play a role in the decision process?}
\label{sec:org6a43e8b}
No. But the distance traveled influence the gain that the boat agents gain from fishing and thus the site they choose for fishing.
