docs/ODD+D_protocol.tex
\subsubsection{Do temporal aspect play a role in the decision process?}
\label{sec:orgfbce6e8}
Yes. Boat agents have a memory of the last place where they fished and got the best catches and the economic gain they got fishing there. 
\subsubsection{To which extent and how is uncertainty included in the agents' decision rules?}
\label{sec:org1876e3e}
Given that a best fishing patch of a boat agent may change in the future given the competition with other boats, migration and population dynamics of biomass and oil spill damage, agents may choose with certain probability to explore a new patch.
\subsection{Learning}
\label{sec:org8b17687}
\subsubsection{Is individual learning included in the decision process? How do individuals change their decision rules over time as consequence of their experience?}
\label{sec:orgf7e7575}
Yes. Explore-Exploit-Imitate is a rudimental way in which boat agents learn the best sites to fish. Agents learn to fish first in patches close to the port as the travel costs are cheaper. As biomass and income goes down they move outwards to new sites.
\subsubsection{Is collective learning implemented in the model?}
\label{sec:orgcadd8ad}
Yes. Boat agents can share information with their friends about their previous best fishing site and income. When an agent identifies a friend whose income was grater than its, it imitates the best fishing site of the friend. This simple mechanism makes more quick and efficient initial the learning of all boat agents.
\subsection{Individual Sensing}
\label{sec:org464fd18}
\subsubsection{What endogenous and exogenous state variables are individuals assumed to sense and consider in their decisions? Is the sensing process erroneous?}
\label{sec:org5506c70}
Boat agents can sens the catch, income and distance traveled (endogenous variables). 
\subsubsection{What state variable of which other individuals can an individual perceive? Is the sensing process erroneous?}
\label{sec:orgd19a80a}
Boat agents can access without error the best fishing site and income of their friends.
\subsubsection{What is the spatial scale of sensing?}
\label{sec:orgdf548ea}
There is no spatial sensing of boat agents.
\subsubsection{Are the mechanisms by which agents obtain information modeled explicitly, or are individuals simply assumed to know these variables?}
\label{sec:orgabf88f1}
The catch and movement of boat agents is modeled explicitly, and income is calculated after them.
\subsubsection{Are the costs for cognition and the costs for gathering information explicitly included in the model?}
\label{sec:orgcca156c}
No. 
\subsection{Individual Prediction}
\label{sec:orgd61c6fc}
\subsubsection{Which data do the agents use to predict future conditions?}
\label{sec:orgc4bff7b}
Data on income gained fishing in a patch.
\subsubsection{What internal models are agents assumed to use to estimate future conditions of consequences of their decisions?}
\label{sec:org8e0fd9c}
The Explore-Exploit-Imitate model (Bailey, Richard M. and Carrella, Ernesto and Axtell, Robert and Burgess, Matthew G. and Cabral, Reniel B. and Drexler, Michael and Dorsett, Chris and Madsen, Jens Koed and Merkl, Andreas and Saul, Steven, 2019).
\subsubsection{Might agents be erroneous in the prediction process, and how is it implemented?}
\label{sec:orgef43f58}
Yes, as boat agent decision is based on previous trip and as biomass available in a patch changes from competition with other boats, migration and regrowth, and oil spill damage the patch on which previously they got high catches might give them bad catches in subsequent visits. 
\subsection{Interaction}
\label{sec:orga42aaff}
\subsubsection{Are interactions among agents and entities assumed as direct or indirect}
\label{sec:org8c15c97}
Boats interact directly with other boats by sharing information. Boats interact directly with the sea patches by consuming the fishing resource (biomass). Boats and platforms interact indirectly as platforms can reduce available biomass for fishers through restricting reducing the fishing area and reducing biomass by oil spils. Turtles have a direct interaction with boats and platforms as there is a probability of death when there is a boat fishing or an oil spill in the patch where they are.
\subsubsection{On what do the interactions depend?}
\label{sec:orgff3e200}
Boats interactions with other boats depend on a random network. Boats interaction with biomass depend on the distance form the port or previous sites where they have fished. Fishing restriction areas are defined at a certain Moore neighborhood from oil platforms. Oil spill extensions depend on the neighborhood of previously contaminated patches. 
\subsubsection{If the interactions involve communication, how are such communications represented?}
\label{sec:orgc18340a}
When planning a new fishing trip boats can access the variable of the best fishing site of their two friends and compare it to theirs.
\subsubsection{If a coordination network exists, how does it affect the agent behavior? Is the structure of the network imposed or emergent?}
\label{sec:org6215c28}
The friendship network allows boats to learn more rapidly where are the fishing sites that generate a greater income. To build the network each boat is connected to other two randomly chosen boats from the same port. 
\subsection{Collectives}
\label{sec:orgb94d5e0}
\subsubsection{Do the individuals form or belong to aggregations that affect, and are affected by, the individuals? Are these aggregations imposed by the modeler or do they emerge during the simulation?}
\label{sec:org9a52bd0}
An aggregate fishing behavior emerges from the boat friendship network. Depending on the number of friends and boats there can be a single of multiple aggregations.
\subsubsection{How are collectives represented?}
\label{sec:orga38ea41}
Boat collectives are emergent properties resulting from the Explore-Exploit-Imitate algorithm. (The model can be extended to consider more than one port, in this case the boats can only form collectives with boats of their same port).
\subsection{Heterogeneity}
\label{sec:orgf1151ed}
\subsubsection{Are the agents heterogeneous? If yes which state variables and/or processes differ between the agents?}
\label{sec:org969225b}
In the base model with only a single port agents are homogeneous. In the extended model with more than one port agents differ in their fishing parameters (fishing region, capacity, catchability, resting times, etc).
\subsubsection{Are the agents heterogeneous in their decision-making? If yes, which decision models or decision objects differ between the agents?}
\label{sec:orged4926b}
Agents are homogeneous in their decision-making.
\subsection{Stochasticity}
\label{sec:orgff836cb}
\subsubsection{What processes (including initialization) are modeled by assuming they are random or partly random?}
\label{sec:orgd748380}
The positioning of oil platforms in the landscape is partly random (we restrict non-playable landscapes where there are inaccessible fishing patches). The friendship network of the boats is random, each boat links to two other randomly chosen boats that land in the same port as them. Starting preferred fishing site of boats is chosen randomly. Explore-Exploit-Imitate algorithm has an stochastic component as boats explore a new fishing sites with certain probability. Oil spills occur according to a given probability and extend following a stochastic percolation model. Turtles initial position is random in their feeding region. Turtles move randomly to their neighbors.
\subsection{Observation}
\label{sec:org2344ec2}
\subsubsection{What data are collected from the ABM for testing, understanding and analyzing it, and how and when are they collected?}
\label{sec:org55dbc45}
To analyze the fishing sub-model we collect data of: catches, fishing income, distance traveled, trip duration, gas expense, average salary and number of viable/crisis/bankrupt boats. This data is collected monthly before the re-initialization of the registers.
To analyze the oil sub-model we collect data of: total production, aggregate production and monthly total income.
To analyze the ecological sub-models we collect daily data of: biomass of each species and number of turtles. 
\subsubsection{What key results, outputs of characteristics of the model are emerging from the individuals? (Emergence)}
\label{sec:org5f1b6e1}
The model captures the formation of fishing fronts, also captures classical bio-economic results (reduction of catches with increasing number of boats, increase fishing effort with as resource depletes)
