docs/ODD+D_protocol.tex
\section{Details}
\label{sec:org3080d2e}
\subsection{Implementation Details}
\label{sec:org0890f17}
\subsubsection{How has the model been implemented?}
\label{sec:org82ba339}
The model was implemented in NetLogo 6.4.0
\subsubsection{Is the model accessible and if so where?}
\label{sec:orgc490776}
Model is available at the \href{https://github.com/b3m3bi/modelo\_PePe}{github repository}. It will be uploaded to comses.
\subsection{Initialization}
\label{sec:orgf27d41d}
\subsubsection{What is the initial state of the model world, i.e., at time t=0 of a simulation run?}
\label{sec:orgd58d85f}
Each patch is initialized with its maximum carrying capacity and with the maximal concentration of oil. There are 3 different species (shrimp, mackerel, huachinango) corresponding to 3 different fishing regions (coastline, platforms, deep water). All boats start in resting state and with an income of \$7500 MXN. Oil platform position is randomly chosen in a specified area (same options as fishing regions). Oil tankers start at their platform. Turtles start at a random position in their feeding area (that corresponds to the deep water region). 
\subsubsection{Is initialization always the same, or is it allowed to vary among simulations?}
\label{sec:orgf8e2ce0}
Each simulation generates a new landscape with different position of the oil platforms in the indicated region. All non-playable landscapes where there is a patch not accessible to boats, due to the restriction area around platforms, are ignored.
\subsubsection{Are the initial values chosen arbitrarily of based on data?}
\label{sec:org85af68c}
Some initial values of parameters are based on data. Others where obtained through a calibration process based on empirical data. An other parameters where chosen arbitrarily for increasing the attractiveness and game play of the model.
A player can control the initial values of: number of boats, fishing region, number of oil platforms, region of oil platforms, size of protected area, activation temporal fishing bans, give oil subsidies to fishers, size of boat and radio of restricted area around platforms.
\subsection{Input Data}
\label{sec:org2667c4e}
\subsubsection{Does the model use input from external sources such as data files or other models to represent processes that change over time?}
\label{sec:org25639bf}
No.
\subsection{Sub-models}
\label{sec:org5361263}
\subsubsection{What, in detail, are the sub-models that represent the processes listed in "Process overview and scheduling"?}
\label{sec:org4325e9b}
Se next section.
\subsubsection{What are the model parameters, their dimensions and reference values?}
\label{sec:orgdbf181f}
Se Table X.
\subsubsection{How were sub-models designed of chosen, and how were they parameterized and then tested?}
\label{sec:org06a845a}
Se next section.
\section{Sub-models}
\label{sec:orgfc7b539}
\subsection{Ecology sub-model}
\label{sec:org35e64be}

This sub model is based on the ecology sub-model of Bailey, Richard M. and Carrella, Ernesto and Axtell, Robert and Burgess, Matthew G. and Cabral, Reniel B. and Drexler, Michael and Dorsett, Chris and Madsen, Jens Koed and Merkl, Andreas and Saul, Steven, 2019. Each patch registers the biomass of fishing species. Biomass disperses daily and grows annually. Dispersion in each patch is simulated by simple diffusion following the next equation:

\[ b_{i,j,t+1} =   b_{i,j,t} +  \sum_k M_i \cdot (b_{i,j,t} - b_{i,k,t}) \]

where \(b_{i,j,t}\) is the biomass of species \(i\) in patch \(j\) during time \(t\), \(M_i\) is the dispersion rate of species \(i\), and \(k\) are the von Neumann neighbors of the patch \(j\) that are also habitat of species \(i\). In the base model we define 3 different species with non overlapping habitats corresponding to 3 different fishing regions (coastline, platforms, deep waters).

Growth is simulated with a simple logistic equation:

\[ b_{i,j,t+1} = b_{i,j,t} + b_{i,j,t} \cdot R_i \cdot \left( 1 - \frac{b_{i,j,t}}{K_i} \right)  \]

where \(R_i\) is the intrinsic growth rate of species \(i\) and \(K_i\) is the carrying capacity of species \(i\), which are the same for all habitat patches of the species. To account for an extra effect due to "perturbation during reproducing period" and not respecting "van periods" we supposed that \(R_i\) is related linearly to the active fishers during reproducing day:

\(R_i = (\frac{R_{\min,i} - R_{\max,i}}{500}) \cdot n_i + R_{\max, i}\)

where \(R_{\min, i}\) and \(R_{\max, i}\) are the minimum and maximum intrinsic growth rates of species \(i\), and  \(n_i\) is the number of active fishing boats of species \(i\) during the reproduction day. In this expression when all fishers respect a temporal ban during the reproduction period \(R_i\) is at its maximum (\(R_{\max,i}\)), meanwhile when 500 fishers don't respect ban period \(R_i\) is at its minimum (\(R_{\min,i}\)). Growth occurs one a year at a custom date for each species. 
