docs/ODD+D_protocol.org
** Fishing sub-model

This sub-model is based on the fishing sub-model of [cite//b:@bailey2019]. Fishers have an activity state. During each model iteration (day) fishers can carry out multiple activities: "rest", "plan", "move", "fish" and "land". Figure X describes the change in activity states.

Each day a boat agents have 24 hours to carry the next activities: rest at port, plan trip, move/navigate, fish and land. When there are no fishing bans boats rest at port for a fixed amount of time (HORAS_DESCANSAR). If there are fishing bans boats stay inactive at port until the ban period ends.

When the resting time ends boats plan their trip. Boats choose their starting trip destination with the Explore-Exploit-Imitate algorithm [cite:@bailey2019]. With a probability \epsilon (EPSILON) boats explore a new site. Possible new sites don't include restricted or protected patches. The new site can be a site nearby the actual preferred fishing site (in the Moore neighborhood of a specified radius RADIO_EXPLORAR) or with a fixed probability (PROB_EXP_REGION) a site in any place of the fishing region. This is a modification from [cite:@bailey2019] model to improve game play and avoid fishers from getting stuck at the corners of the world and collapse, this modification allows fishers to found non used areas more efficiently in conditions close to the depletion of the resource. When boats don't explore a new site they can exploit or imitate. If one of their friends got a greater income than them in their last trip they imitate them and visit their friend's best site. When their last income wast greater than their's friends they exploit their own best last fishing site. We suppose that planning cost no time to boat agents.

Boat agents move by following the A* pathfinder algorithm. This algorithm computes the route of boats follow considering that they cannot navigate through restricted areas. Boats move with a velocity (VELOCIDAD) in a continuous way (Euler's distance) through the patches. The minimum movement time cost is 1 hour.

When boat agents arrive to a fishing site they fish a species according to their gear (ESPECIES_PESCA). In the base model boats only fish a single species, they capture a fixed proportion of the available biomass in the patch (CAPTURABILIDAD; in the extended model when boats fish more than one species the capture is proportional to the biomass of species at that patch). Boats can only hold a fixed amount of catch (CAPACIDAD_MAXIMA; when they capture more than the maximum capacity they return the excess). Each deployment of fishing gear is supposed to cost the boats 1 hour. After fishing boats decide what to do next depending on their catches and time passed on sea. If a boat is full, then it plans the return trip to the port. If the boat isn't full but a maximum amount of time on the sea has passed (TIEMPO_MAXIMO_EN_MAR) then it plans the return trip to the port. Finally, if the boat isn't full and it hasn't passed sufficient time at the sea it plans where to continue the trip. The trip is continued by choosing randomly a neighboring patch at a fixed radio (Moore neighborhood).

When a boat ends its trip at the port it lands the catches, sells them and calculates its income based on a fixed price and costs of gas:

\begin{align*}
\text{INCOME}_{\text{fishing}} = (\text{CATCH} \times \text{PRICE OF BIOMASS})\\
- (\text{GAS PRICE} \times \text{LITTERS PER DISTANCE} \times \text{PATCH LENGTH} \times \text{DISTANCE TRAVELED}) \\
- (\text{LITTERS PER FISHING HOUR} \times \text{NUMER OF FISHING SITES VISITED}) 
\end{align*}

After landing and selling the catch, boats rest at port, to start a new trip.

** Turtles sub-model

Turtles can move, reproduce and die. Each time-step (day) turtles choose one random neighbor patch and move towards it by a length unit (size of patch). The movement of the turtles is restricted to two different regions of the world depending on the period of the year. From October to April they move in their "feeding area" a region defined far away of the coast. From May to September turtles move in the "reproductive area" near the coast line. On the first day of May turtles migrate towards the "reproductive area" by restricting their movement only to the 3 patches towards the coast. On the first day of October turtles migrate towards the "feeding area" by restricting their movement only to the 3 patches towards the "deep waters". When turtles reach their destination random movement resumes.

All turtles reproduce on the 180'th day of the year. They produce NUM_DESCENDIENTES_TORTUGAS siblings. Three different events can kill a turtle: 1) overpopulation, 2) incidental catches, and 3) oil spill damage. Overpopulation mortality only operates in the "feeding area". In each feeding patch there can be at maximum CAPACIDAD_CARGA_TORTUGAS turtles. In a time-step we kill the surplus population in a patch by randomly killing turtles until the maximum capacity of the patch is reached. As turtles start to migrate at the same moment they reach the "feeding area" similar periods. So after migration there is a huge overpopulation on the feeding patches nearest to the coast. To avoid excess mortality due to synchronous migration of turtles we add a "buffer time". For overpopulation mortality to start operating turtles must have passed TIEMPO_BUFFER_TORTUGAS time-steps (days) in the "feeding region". This gives time for turtles to distribute over the "feeding region" avoiding a huge mortality due to the movement and migration mechanisms.

Turtles can also die due to fishing and oil spills. We supposed that when turtles are in the same patch as a boat that is fishing then there is a probability (PROB_MORTALIDAD_TORTUGA_POR_PESCA) of death. Additionally we supposed that when the turtles is in a patch that has an oil spill it has a probability of dying (MORTALIDAD_TORTUGAS_DERRAME). 

